Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Alternatively, you can use the `TFT_eSPI <https://github.com/Bodmer/TFT_eSPI>`__ library.
it_it: In alternativa, è possibile utilizzare la libreria `TFT_eSPI <https://github.com/Bodmer/TFT_eSPI>`__.

source: Alternatively, you might have access to a drawing library that performs certain types of drawing tasks with great efficiency.
it_it: In alternativa, è possibile accedere a una libreria che esegue determinati tipi di attività di disegno con grande efficienza.

source: Although ESP32 are supported on other frameworks also supported by LVGL, it is recommended the user to check the following pages:
it_it: Sebbene ESP32 sia supportato su altri framework che includono anche LVGL, si consiglia all'utente di consultare le seguenti pagine:

source: Although LVGL can decode and display any Unicode characters (assuming the font supports them), LVGL cannot correctly render all complex languages.
it_it: Sebbene LVGL possa decodificare e visualizzare qualsiasi carattere Unicode (a condizione che il font li supporti), non è in grado di visualizzare correttamente tutte le lingue complesse.

source: Although NuttX has its own graphic library called `NX <https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=139629474>`__, LVGL is a good alternative because users could find more eye-candy demos and they can reuse code from previous projects.
it_it: Sebbene NuttX abbia una propria libreria grafica chiamata `NX <https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=139629474>`__, LVGL è una buona alternativa perché gli utenti potrebbero trovare demo più accattivanti e riutilizzare il codice di progetti precedenti.

source: Although called "user_data", the user is not expected to read/write that field.
it_it: Sebbene chiamato "user_data", non è previsto che l'utente legga/scriva tale campo.

source: Although in the browser it's possible to view and edit the XML files, it's not possible to save the changes.
it_it: Sebbene nel browser sia possibile visualizzare e modificare i file XML, non è possibile salvare le modifiche.

source: Although it's just a simple rectangle, the Base Widget is the most powerful widget, as it supports all the features that other widgets can use.
it_it: Sebbene si tratti solo di un semplice rettangolo, il Widget Base è quello più potente, poiché supporta tutte le funzionalità che altri widget possono utilizzare.

source: Although they can't contain C code, they are very powerful:
it_it: Sebbene non possano contenere codice C, sono molto potenti:

source: Although this is a generic driver, it can be used to support compatible chips which do not have a specific driver.
it_it: Sebbene si tratti di un driver generico, può essere utilizzato per supportare chip compatibili che non dispongono di un driver specifico.

source: Although widgets are compiled into the application, they need to be registered so the XML parser knows how to create an element like ``<lv_slider>`` when it appears in XML.
it_it: Sebbene i widget siano compilati nell'applicazione, devono essere registrati affinché il parser XML sappia come creare un elemento come ``<lv_slider>`` quando appare in XML.

source: Although you can get LVGL for free there is a massive amount of work behind it.
it_it: Sebbene LVGL sia disponibile gratuitamente, dietro c'è un enorme lavoro.

source: Always start Doxygen comment with a brief description of the code element it documents.
it_it: Iniziare sempre un commento Doxygen con una breve descrizione dell'elemento di codice che documenta.

source: Always-off for maximum performance
it_it: Sempre disattivato per le massime prestazioni

source: Always-on for consistent quality
it_it: Sempre attivo per una qualità costante

source: Ambient occlusion textures
it_it: Texture per occlusione ambientale

source: Among many others, this can effectively speed up UI rendering.
it_it: Tra le altre cose, questo può effettivamente velocizzare il rendering dell'interfaccia utente.

source: Among the results of ``ls`` you should see ``app-release-exec-linux``.
it_it: Tra i risultati di ``ls`` si dovrebbe vedere ``app-release-exec-linux``.

source: An :cpp:expr:`lv_font_t` pointer compiled into the firmware (``as_file="false"``).
it_it: Un puntatore :cpp:expr:`lv_font_t` compilato nel firmware (``as_file="false"``).

source: An Animation has completed when:
it_it: Un'Animazione è completata quando:

source: An Image Decoder is a body of logic that can convert a coded image into one of the recognized formats.
it_it: Un Image Decoder è un insieme di funzioni logiche in grado di convertire un'immagine codificata in uno dei formati riconosciuti.

source: An LZ4 image binary can be directly generated from another image using script ``lvgl/scripts/LVGLImage.py``.
it_it: Un'immagine binaria LZ4 può essere generata direttamente da un'altra immagine utilizzando lo script ``lvgl/scripts/LVGLImage.py``.

source: An OpenGL context must be created before using the OpenGL driver.
it_it: Prima di utilizzare il driver OpenGL, è necessario creare un contesto OpenGL.

source: An RLE image binary can be directly generated from another image using script ``lvgl/script/LVGLImage.py``.
it_it: Un'immagine binaria RLE può essere generata direttamente da un'altra immagine utilizzando lo script ``lvgl/script/LVGLImage.py``.

source: An RTOS/OS must be present.
it_it: Deve essere presente un RTOS/OS.

source: An XML file to define only the API (e.g., `lv_slider.xml <https://github.com/lvgl/lvgl/blob/master/xmls/lv_slider.xml>`__), used only in the UI |nbsp| Editor to validate and autocomplete properties
it_it: Un file XML per definire solo l'API (ad esempio, `lv_slider.xml <https://github.com/lvgl/lvgl/blob/master/xmls/lv_slider.xml>`__), utilizzato solo nell'UI |nbsp| Editor per convalidare e completare automaticamente le proprietà

source: An XML parser C file to map the XML attributes to C functions (e.g., `lv_xml_slider_parser.c <https://github.com/lvgl/lvgl/blob/master/src/others/xml/parsers/lv_xml_slider_parser.c>`__)
it_it: Un file C parser XML per mappare gli attributi XML alle funzioni C (ad esempio, `lv_xml_slider_parser.c <https://github.com/lvgl/lvgl/blob/master/src/others/xml/parsers/lv_xml_slider_parser.c>`__)

source: An ``lv_prop_id_t`` is a :ref:`widget_property_id`, whereas an ``lv_property_t`` is a struct that pairs a :ref:`widget_property_id` with a :ref:`widget_property_value`.
it_it: Un ``lv_prop_id_t`` è un :ref:`widget_property_id`, mentre un ``lv_property_t`` è una struttura che associa un :ref:`widget_property_id` a un :ref:`widget_property_value`.

source: An `score` equal to `100` is the default CPU score.
it_it: Uno `score` uguale a `100` è quello di default della CPU.

source: An array of any type can be defined in three ways:
it_it: Un array di qualsiasi tipo può essere definito in tre modi:

source: An array of pixels can be copied to the Canvas with :cpp:expr:`lv_canvas_copy_buf(canvas, canvas_area, src_buf, src_area)`.
it_it: Un array di pixel può essere copiato sul Canvas con :cpp:expr:`lv_canvas_copy_buf(canvas, canvas_area, src_buf, src_area)`.

source: An array terminated with a ``NULL`` element.
it_it: Un array che termina con un elemento ``NULL``.

source: An array to describe the columns of the grid.
it_it: Un array per descrivere le colonne della griglia.

source: An array to describe the rows of the grid.
it_it: Un array per descrivere le righe della griglia.

source: An element of ``ctrl_map`` should look like :cpp:expr:`ctrl_map[0] = width | LV_BUTTONMATRIX_CTRL_NO_REPEAT | LV_BUTTONMATRIX_CTRL_CHECKABLE`.
it_it: Un elemento di ``ctrl_map`` dovrebbe apparire come :cpp:expr:`ctrl_map[0] = width | LV_BUTTONMATRIX_CTRL_NO_REPEAT | LV_BUTTONMATRIX_CTRL_CHECKABLE`.

source: An encoder
it_it: Un encoder

source: An encoder is a device with a pressable turning knob that tells the hosting device:
it_it: Un encoder è un dispositivo con una manopola girevole che può essere premuta e che indica al dispositivo host:

source: An example CMakeLists file has been provided at ``/env_support/esp/rlottie/CMakeLists.txt``
it_it: Un file CMakeLists di esempio è disponibile all'indirizzo ``/env_support/esp/rlottie/CMakeLists.txt``

source: An example for this is shown below, using the Linux framebuffer driver.
it_it: Un esempio è mostrato di seguito, utilizzando il driver framebuffer Linux.

source: An example is the autotools* class, which contains common settings for any application that is built with the `GNU Autotools <https://en.wikipedia.org/wiki/GNU_Autotools>`.
it_it: Un esempio è la classe autotools*, che contiene impostazioni comuni per qualsiasi applicazione compilata con `GNU Autotools <https://en.wikipedia.org/wiki/GNU_Autotools>`.

source: An example looks like this:
it_it: Un esempio è il seguente:

source: An example of such a function is :cpp:func:`lv_os_get_idle_percent` in ``lv_freertos.c``.
it_it: Un esempio di tale funzione è :cpp:func:`lv_os_get_idle_percent` in ``lv_freertos.c``.

source: An example of such an application is available in the source tree: ``examples/others/gestures/lv_example_gestures.c``.
it_it: Un esempio di tale applicazione è disponibile nell'albero sorgente: ``examples/others/gestures/lv_example_gestures.c``.

source: An example on how to draw a colored bitmap glyph is shown below.
it_it: Di seguito è riportato un esempio su come disegnare un glifo bitmap colorato.

source: An extensive range of Colibri-compatible carrier boards and accessories, such as cameras and displays, is also available for easy product development on the Colibri Arm family of modules.
it_it: È inoltre disponibile un'ampia gamma di schede carrier e accessori compatibili con Colibri, come fotocamere e display, per un facile sviluppo di prodotti sulla famiglia di moduli Colibri Arm.

source: An image can be thought of as set of pixels used to create an image on a Display.
it_it: Un'immagine può essere considerata un insieme di pixel utilizzati per creare un'immagine su un display.

source: An image decoder consists of 4 callbacks:
it_it: Un image decoder è composto da 4 callback:

source: An image or glyph will not be uploaded until it needs to be rendered.
it_it: Un'immagine o un glifo non verrà caricato finché non sarà necessario renderizzarlo.

source: An initialized ``lv_style_transition_dsc_t`` to describe a transition.
it_it: Un ``lv_style_transition_dsc_t`` inizializzato per descrivere una transizione.

source: An integer array.
it_it: Un array di interi.

source: An issue can be developed when all the questions in the issue template are answered and there are no objection from any core member.
it_it: Una issue [problematica] può essere sviluppata quando tutte le domande nel "issue template" hanno ricevuto risposta e non ci sono obiezioni da parte di alcun membro principale.

source: An item can span multiple columns or rows.
it_it: Un elemento può estendersi su più colonne o righe.

source: An offset to the 0-degree position can be added with :cpp:expr:`lv_arc_set_rotation(arc, deg)`.
it_it: È possibile aggiungere un offset alla posizione a 0 gradi con :cpp:expr:`lv_arc_set_rotation(arc, deg)`.

source: An vertical scale with section and custom styling
it_it: Una scala verticale con sezioni e stile personalizzato

source: And ESP32/ESP32-S3 support 240MHz:
it_it: E ESP32/ESP32-S3 supportano 240 MHz:

source: And finally add the ``-lrlottie`` flag to your linker.
it_it: E infine, si aggiunge il flag ``-lrlottie`` al linker.

source: And in XML, it can be used like this:
it_it: E in XML può essere utilizzato in questo modo:

source: And it can be used like:
it_it: Può essere utilizzato in questo modo:

source: And many more
it_it: E molto altro

source: And these build presets:
it_it: E questi sono i preset della build:

source: And used as:
it_it: e utilizzata come:

source: Angle Configuration
it_it: Configurazione dell'Angolo

source: Angles are measured in degrees, starting from the positive x-axis (3 o'clock position) and increasing clockwise.
it_it: Gli angoli sono misurati in gradi, partendo dall'asse x positivo (ore 3) e aumentando in senso orario.

source: Animated punctual lights with dynamic lighting effects
it_it: Luci puntuali animate con effetti di illuminazione dinamici

source: Animating in Both Directions
it_it: Animazione in Entrambe le Direzioni

source: Animation
it_it: Animazione

source: Animation (lv_anim)
it_it: Animazione (lv_anim)

source: Animation Control
it_it: Controllo Animazione

source: Animation Image
it_it: Immagine animata

source: Animation Image (lv_animimg)
it_it: Immagine di Animazione (lv_animimg)

source: Animation Path
it_it: Path dell'Animazione

source: Animation Speed System
it_it: Sistema di Velocità delle Animazioni

source: Animation System
it_it: Sistema di Animazione

source: Animation duration in milliseconds.
it_it: Durata dell'animazione in millisecondi.

source: Animation playback controls
it_it: Controlli di riproduzione dell'animazione

source: Animation speeds use integer values to avoid floating-point arithmetic:
it_it: Le velocità delle animazioni utilizzano valori interi per evitare calcoli aritmetici in virgola mobile:

source: Animation support (not yet supported in the LVGL integration)
it_it: Supporto per le animazioni (non ancora supportato nell'integrazione LVGL)

source: Animation template for Widget's animation.
it_it: Template per l'animazione del Widget.

source: Animation timeline
it_it: Timeline animazione

source: Animations
it_it: Animazioni

source: Animations allow you to define the way something should move or change over time, and let LVGL do the heavy lifting of making it happen.
it_it: Le animazioni consentono di definire il modo in cui qualcosa dovrebbe muoversi o cambiare nel tempo, lasciando che LVGL si occupi del grosso del lavoro.

source: Another (possibly simpler) option to create and display an image at run-time is to use the :ref:`Canvas <lv_canvas>` Widget.
it_it: Un'altra opzione (forse più semplice) per creare e visualizzare un'immagine in fase di esecuzione è utilizzare il Widget :ref:`Canvas <lv_canvas>`.

source: Another Widget can be positioned according to the current position of the Arc in order to follow the Arc's current value (angle).
it_it: Un altro Widget può essere posizionato in base alla posizione corrente dell'Arco per seguirne il valore corrente (angolo).

source: Another case where the cache should be disabled is if the file contents are expected to change by an external factor like with special OS files.
it_it: Un altro caso in cui la cache dovrebbe essere disabilitata è quando si prevede che il contenuto del file cambi a causa di un fattore esterno, come nel caso di file speciali del sistema operativo.

source: Another popular option is the ``TFT_eSPI library``, which supports a wide range of displays.
it_it: Un'altra opzione popolare è la ``TFT_eSPI library``, che supporta un'ampia gamma di display.

source: Another way to build this project is to use the provided CMakePresets.json or pass options using the command line.
it_it: Un altro modo per compilare questo progetto è utilizzare il file CMakePresets.json fornito o passare le opzioni tramite la riga di comando.

source: Another way you can add an image to your project is by using the :ref:`images_offline_converter` to create a ``.bin`` file.
it_it: Un altro modo per aggiungere un'immagine al progetto è utilizzare :ref:`images_offline_converter` per creare un file ``.bin``.

source: Any Python or JavaScript file in ``tools`` that begins with ``transform-`` will be treated as a possible transform which will be passed the file to minify via ``stdin`` and the minified output is expected from ``stdout``.
it_it: Qualsiasi file Python o JavaScript in ``tools`` che inizia con ``transform-`` verrà trattato come una possibile trasformazione, a cui verrà passato il file da minificare tramite ``stdin`` e l'output minificato è atteso da ``stdout``.

source: Any Widget Type
it_it: Qualsiasi Tipo di Widget

source: Any Widget can be scrollable including :ref:`base_widget`, ``lv_image``, ``lv_button``, ``lv_meter``, etc
it_it: Qualsiasi widget può essere "scrollable" [scorrevole], inclusi :ref:`base_widget`, ``lv_image``, ``lv_button``, ``lv_meter``, ecc.

source: Any ``offset`` value is applied after the image source is aligned.
it_it: Qualsiasi valore di ``offset`` viene applicato dopo l'allineamento della sorgente dell'immagine.

source: Any compiler that supports the target Arm architecture can be used to compile LVGL's source code, including GCC, LLVM, and AC6.
it_it: Qualsiasi compilatore che supporti l'architettura Arm come target può essere utilizzato per compilare il codice sorgente di LVGL, inclusi GCC, LLVM e AC6.

source: Any derivative work based on MIT licensed code must copy the original work's license file or text.
it_it: Qualsiasi opera derivata basata su codice con licenza MIT deve copiare il file di licenza o il testo dell'opera originale.

source: Any direction of swiping can be disabled on the tiles individually to not allow moving from one tile to another.
it_it: Qualsiasi direzione di scorrimento può essere disabilitata sui tile singolarmente per impedire lo spostamento da un tile all'altro.

source: Any extended click area (set by :cpp:expr:`lv_obj_set_ext_click_area(slider, value)`) increases the knob's click area.
it_it: Qualsiasi area di clic estesa (impostata da :cpp:expr:`lv_obj_set_ext_click_area(slider, value)`) aumenta l'area di clic della manopola.

source: Any files placed outside these locations will not be compiled or linked automatically.
it_it: Tutti i file posizionati al di fuori di queste posizioni non verranno compilati né linkati automaticamente.

source: Any length value set outside of these limits will automatically result in a length fixed to either limit.
it_it: Qualsiasi valore di lunghezza impostato al di fuori di questi limiti comporterà automaticamente una lunghezza fissata a uno dei due limiti.

source: Any local style properties, for example, ``style_bg_color="0x333"``
it_it: Qualsiasi proprietà di stile locale, ad esempio, ``style_bg_color="0x333"``

source: Any modifications can be done on the children here.
it_it: Qui è possibile apportare modifiche agli elementi figlio.

source: Any number of Observers can be created and be associated with a Widget this way.
it_it: In questo modo è possibile creare un numero qualsiasi di Observer e associarli a un Widget.

source: Any number of Observers can be created for a single Widget, each bound to ONE of the above properties.
it_it: È possibile creare un numero qualsiasi di Observer per un singolo Widget, ciascuno associato a UNA delle proprietà sopra indicate.

source: Any number of cursors
it_it: Un numero qualsiasi di cursori

source: Any number of custom event codes can be registered by ``uint32_t MY_EVENT_1 =`` :cpp:func:`lv_event_register_id`
it_it: È possibile registrare un numero qualsiasi di codici evento personalizzati tramite ``uint32_t MY_EVENT_1 =`` :cpp:func:`lv_event_register_id`

source: Any number of data series
it_it: Qualsiasi numero di serie di dati

source: Any number of themes can be chained this way.
it_it: È possibile concatenare un numero qualsiasi di temi in questo modo.

source: Any of the callbacks can be ``NULL`` to indicate that operation is not supported.
it_it: Qualsiasi callback può essere ``NULL`` per indicare che l'operazione non è supportata.

source: Any of the following Widget properties can be thus bound to an Subject's integer value:
it_it: Qualsiasi delle seguenti proprietà del Widget può essere quindi associata al valore intero di un Subject:

source: Any of the sources can be ``NULL``.
it_it: Qualsiasi sorgente può essere ``NULL``.

source: Any part of the text can be selected if enabled with :cpp:expr:`lv_textarea_set_text_selection(textarea, true)`.
it_it: È possibile selezionare qualsiasi parte del testo se abilitata con :cpp:expr:`lv_textarea_set_text_selection(textarea, true)`.

source: Anything else with a strong enough MCU and a peripheral to drive a display
it_it: Qualsiasi altro dispositivo con una MCU sufficientemente potente e una periferica per pilotare un display

source: Apalis Carrier Boards:
it_it: Schede Carrier Apalis:

source: Apalis Computer on Module:
it_it: Computer on Module Apalis:

source: Apalis enables the development of advanced and robust products within a short time and with low risks.
it_it: Apalis consente lo sviluppo di prodotti avanzati e robusti in tempi rapidi e con rischi ridotti.

source: Apalis is a scalable System on Module (SoM) / Computer on Module (CoM) family that aims to provide high performance in a compact form factor.
it_it: Apalis è una famiglia scalabile di System on Module (SoM) / Computer on Module (CoM) che mira a fornire elevate prestazioni in un fattore di forma compatto.

source: Apalis modules are suited to a larger number of applications in such fields as healthcare, industrial automation, robotics, smart cities and many more.
it_it: I moduli Apalis sono adatti a un ampio numero di applicazioni in settori quali sanità, automazione industriale, robotica, smart city e molti altri.

source: Apalis modules are supported by Toradex software offerings and the company's rich ecosystem of other products and services.
it_it: I moduli Apalis sono supportati dall'offerta software Toradex e dal ricco ecosistema di altri prodotti e servizi dell'azienda.

source: Apalis modules scale to the highest performance in the Toradex product range, and they provide the most interfaces of any product line on the 314-pin MXM connectors.
it_it: I moduli Apalis raggiungono le prestazioni più elevate nella gamma di prodotti Toradex e offrono il maggior numero di interfacce di qualsiasi altra linea di prodotti sui connettori MXM a 314 pin.

source: Append empty "()" to function names.
it_it: Aggiungere un "()" vuoto ai nomi di funzione.

source: Appendix
it_it: Appendice

source: Application Development
it_it: Sviluppo di Applicazioni

source: Application crashes when enabling PPA
it_it: L'applicazione va in "crash" quando si abilita PPA.

source: Application integration utilities
it_it: Utility di integrazione delle applicazioni

source: Applied after layouts, aligns and other positioning.
it_it: Applicato dopo layout, allineamenti e altri posizionamenti.

source: Applied on each lv_part separately before the children are rendered.
it_it: Applicato separatamente a ogni lv_part prima del rendering degli elementi figlio.

source: Apply changes to the build system
it_it: Applicare le modifiche al sistema di build

source: Apply the patch file to your rlottie submodule.
it_it: Applicare il file di patch al sottomodulo rlottie.

source: Applying a new dictionary
it_it: Applicazione di un nuovo dizionario

source: Approach
it_it: Approccio

source: Aquila Carrier Boards:
it_it: Schede Carrier Aquila:

source: Aquila Computer on Module:
it_it: Computer on Module Aquila:

source: Aquila is a new System on Module standard expanding the Toradex portfolio to new heights, offering unparalleled performance for computationally intensive CPU, machine learning, and vision workloads.
it_it: Aquila è un nuovo standard System on Module che espande il portfolio Toradex a nuovi livelli, offrendo prestazioni senza pari per carichi di lavoro CPU, machine learning e visione artificiale ad alta intensità di calcolo.

source: Arabic and Persian support
it_it: Supporto per arabo e persiano

source: Arc
it_it: Arco

source: Arc (lv_arc)
it_it: Arco (lv_arc)

source: Arc Draw Descriptor
it_it: Descrittore di Disegno dell'Arco

source: Arc Label (lv_arclabel)
it_it: Label Arco (lv_arclabel)

source: Arc center point.
it_it: Punto centrale dell'arco.

source: Arc color.
it_it: Colore dell'arco.

source: Arc opacity (0--255).
it_it: Opacità dell'arco (0-255).
